Design Pattern
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
设计模式 是站在 软件结构和软件系统来看待的 和特定语言无关

设计模式 一共三种类型 
1. 创建型模式: 从创建的角度来看。 						单例模式, 原型模式, 工厂模式 抽象工厂模式 建造者模式
2. 结构型模式: 站在软件的结构 怎么有伸缩性 弹性 扩展性。    装饰模式 代理模式
3. 行为型模式: 站在 方法这个角度   						模版方法模式



-------- 
单例 模式
-------- 
单例模式 singleton
采取一定的方法: 目的是 让整个软件系统系统里面的 某个类的 只能存在"一个对象实例" 
	且该类只提供一个获取其对象的方法, 该方法一般是静态的.













-------- 
原型模式
-------- 
解决的是 怎么克隆一个对象 深拷贝 还是浅拷贝



--------
装饰模式
--------
解决 类爆炸的问题 防止 很多很多类



----------
模版方法模式
----------
怎么设计方法更合理




