https://www.1point3acres.com/bbs/thread-573371-1-1.html

https://www.1point3acres.com/bbs/thread-594843-1-1.html

---------------------------------------------------------------------------------------------------------
OA一共5个问题 
第一个问毕业时间 
第二个5分钟写 Restful API 
第三个SQL 
第四个30分钟的编程题，medium或者hard 
第五个一个easy的编程题 api和sql的地里都有







--------------------------------------------------------------------------------------------------------------------------------------------
主要是讲你对SVNT program的理解和为什么适合你, 然后要很详细的讲你的一个project, 遇到的困难和挑战, 和从中学到了什么

写一个polymorphism, 就是class inheritance和interface什么的..然后我就边写他们边提示的过..然后坐下来问我一些java的理论题




---------------------------------------------------------------------------------------------------------
max depth of n-nary tree

利口舞溜

利口妖似似




